# MEMBALIK URUTAN BARIS DAN KOLOM PADA DATA FRAME ##

## Import Modules ###

In [12]:
import pandas as pd
import numpy as np

print (pd.__version__)
print(np.__version__)

1.3.4
1.20.3

# Persiapan Data Frame ##

In [14]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  8  9  3  4  8
1  5  8  2  4  5
2  7  9  3  3  5
3  3  4  2  9  6
4  4  3  6  5  8

## Membalik Urutan Kolom ##

In [15]:
df.loc[:, ::-1]

   E  D  C  B  A
0  8  4  3  9  8
1  5  4  2  8  5
2  5  3  3  9  7
3  6  9  2  4  3
4  8  5  6  3  4

# Membalik Urutan Baris ##

In [19]:
df.loc[::-1]

   A  B  C  D  E
4  4  3  6  5  8
3  3  4  2  9  6
2  7  9  3  3  5
1  5  8  2  4  5
0  8  9  3  4  8

# Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index ##

In [20]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  4  3  6  5  8
1  3  4  2  9  6
2  7  9  3  3  5
3  5  8  2  4  5
4  8  9  3  4  8